{"name":{"entry":20,"name":"Taha","meaning":"Ta-Ha"},"verses":[{"arabic":" طه","translation":"Ta-Ha.","transliteration":"Ta-ha"},{"arabic":"مَآ أَنزَلْنَا عَلَيْكَ ٱلْقُرْءَانَ لِتَشْقَىٰٓ","translation":"We have not sent down the Qur'an to thee to be (an occasion) for thy distress,","transliteration":"Ma anzalna AAalayka alqur-analitashqa"},{"arabic":"إِلَّا تَذْكِرَةً لِّمَن يَخْشَىٰ","translation":"But only as an admonition to those who fear (Allah),-","transliteration":"Illa tathkiratan liman yakhsha"},{"arabic":"تَنزِيلًا مِّمَّنْ خَلَقَ ٱلْأَرْضَ وَٱلسَّمَـٰوَٰتِ ٱلْعُلَى","translation":"A revelation from Him Who created the earth and the heavens on high.","transliteration":"Tanzeelan mimman khalaqa al-arda wassamawatialAAula"},{"arabic":"ٱلرَّحْمَـٰنُ عَلَى ٱلْعَرْشِ ٱسْتَوَىٰ","translation":"(Allah) Most Gracious is firmly established on the throne (of authority).","transliteration":"Arrahmanu AAalaalAAarshi istawa"},{"arabic":"لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَمَا بَيْنَهُمَا وَمَا تَحْتَ ٱلثَّرَىٰ","translation":"To Him belongs what is in the heavens and on earth, and all between them, and all beneath the soil.","transliteration":"Lahu ma fee assamawatiwama fee al-ardi wama baynahuma wamatahta aththara"},{"arabic":"وَإِن تَجْهَرْ بِٱلْقَوْلِ فَإِنَّهُۥ يَعْلَمُ ٱلسِّرَّ وَأَخْفَى","translation":"If thou pronounce the word aloud, (it is no matter): for verily He knoweth what is secret and what is yet more hidden.","transliteration":"Wa-in tajhar bilqawli fa-innahuyaAAlamu assirra waakhfa"},{"arabic":"ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ۖ لَهُ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ","translation":"Allah! there is no god but He! To Him belong the most Beautiful Names.","transliteration":"Allahu la ilaha illahuwa lahu al-asmao alhusna"},{"arabic":"وَهَلْ أَتَىٰكَ حَدِيثُ مُوسَىٰٓ","translation":"Has the story of Moses reached thee?","transliteration":"Wahal ataka hadeethu moosa"},{"arabic":"إِذْ رَءَا نَارًا فَقَالَ لِأَهْلِهِ ٱمْكُثُوٓا۟ إِنِّىٓ ءَانَسْتُ نَارًا لَّعَلِّىٓ ءَاتِيكُم مِّنْهَا بِقَبَسٍ أَوْ أَجِدُ عَلَى ٱلنَّارِ هُدًى","translation":"Behold, he saw a fire: So he said to his family, \"Tarry ye; I perceive a fire; perhaps I can bring you some burning brand therefrom, or find some guidance at the fire.\"","transliteration":"Ith raa naran faqalali-ahlihi omkuthoo innee anastu naran laAAallee ateekumminha biqabasin aw ajidu AAala annarihuda"},{"arabic":"فَلَمَّآ أَتَىٰهَا نُودِىَ يَـٰمُوسَىٰٓ","translation":"But when he came to the fire, a voice was heard: \"O Moses!","transliteration":"Falamma ataha noodiya yamoosa"},{"arabic":"إِنِّىٓ أَنَا۠ رَبُّكَ فَٱخْلَعْ نَعْلَيْكَ ۖ إِنَّكَ بِٱلْوَادِ ٱلْمُقَدَّسِ طُوًى","translation":"\"Verily I am thy Lord! therefore (in My presence) put off thy shoes: thou art in the sacred valley Tuwa.","transliteration":"Innee ana rabbuka fakhlaAAnaAAlayka innaka bilwadi almuqaddasi tuwa"},{"arabic":"وَأَنَا ٱخْتَرْتُكَ فَٱسْتَمِعْ لِمَا يُوحَىٰٓ","translation":"\"I have chosen thee: listen, then, to the inspiration (sent to thee).","transliteration":"Waana ikhtartuka fastamiAAlima yooha"},{"arabic":"إِنَّنِىٓ أَنَا ٱللَّهُ لَآ إِلَـٰهَ إِلَّآ أَنَا۠ فَٱعْبُدْنِى وَأَقِمِ ٱلصَّلَوٰةَ لِذِكْرِىٓ","translation":"\"Verily, I am Allah: There is no god but I: So serve thou Me (only), and establish regular prayer for celebrating My praise.","transliteration":"Innanee ana Allahu lailaha illa ana faAAbudnee waaqimi assalatalithikree"},{"arabic":"إِنَّ ٱلسَّاعَةَ ءَاتِيَةٌ أَكَادُ أُخْفِيهَا لِتُجْزَىٰ كُلُّ نَفْسٍۭ بِمَا تَسْعَىٰ","translation":"\"Verily the Hour is coming - My design is to keep it hidden - for every soul to receive its reward by the measure of its Endeavour.","transliteration":"Inna assaAAata atiyatunakadu okhfeeha litujza kullu nafsin bimatasAAa"},{"arabic":"فَلَا يَصُدَّنَّكَ عَنْهَا مَن لَّا يُؤْمِنُ بِهَا وَٱتَّبَعَ هَوَىٰهُ فَتَرْدَىٰ","translation":"\"Therefore let not such as believe not therein but follow their own lusts, divert thee therefrom, lest thou perish!\"..","transliteration":"Fala yasuddannaka AAanhaman la yu/minu biha wattabaAAa hawahufatarda"},{"arabic":"وَمَا تِلْكَ بِيَمِينِكَ يَـٰمُوسَىٰ","translation":"\"And what is that in the right hand, O Moses?\"","transliteration":"Wama tilka biyameenika ya moosa"},{"arabic":"قَالَ هِىَ عَصَاىَ أَتَوَكَّؤُا۟ عَلَيْهَا وَأَهُشُّ بِهَا عَلَىٰ غَنَمِى وَلِىَ فِيهَا مَـَٔارِبُ أُخْرَىٰ","translation":"He said, \"It is my rod: on it I lean; with it I beat down fodder for my flocks; and in it I find other uses.\"","transliteration":"Qala hiya AAasaya atawakkaoAAalayha waahushshu biha AAala ghanameewaliya feeha maaribu okhra"},{"arabic":"قَالَ أَلْقِهَا يَـٰمُوسَىٰ","translation":"(Allah) said, \"Throw it, O Moses!\"","transliteration":"Qala alqiha ya moosa"},{"arabic":"فَأَلْقَىٰهَا فَإِذَا هِىَ حَيَّةٌ تَسْعَىٰ","translation":"He threw it, and behold! It was a snake, active in motion.","transliteration":"Faalqaha fa-itha hiya hayyatuntasAAa"},{"arabic":"قَالَ خُذْهَا وَلَا تَخَفْ ۖ سَنُعِيدُهَا سِيرَتَهَا ٱلْأُولَىٰ","translation":"(Allah) said, \"Seize it, and fear not: We shall return it at once to its former condition\"..","transliteration":"Qala khuthha walatakhaf sanuAAeeduha seerataha al-oola"},{"arabic":"وَٱضْمُمْ يَدَكَ إِلَىٰ جَنَاحِكَ تَخْرُجْ بَيْضَآءَ مِنْ غَيْرِ سُوٓءٍ ءَايَةً أُخْرَىٰ","translation":"\"Now draw thy hand close to thy side: It shall come forth white (and shining), without harm (or stain),- as another Sign,-","transliteration":"Wadmum yadaka ila janahikatakhruj baydaa min ghayri soo-in ayatan okhra"},{"arabic":"لِنُرِيَكَ مِنْ ءَايَـٰتِنَا ٱلْكُبْرَى","translation":"\"In order that We may show thee (two) of our Greater Signs.","transliteration":"Linuriyaka min ayatinaalkubra"},{"arabic":"ٱذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُۥ طَغَىٰ","translation":"\"Go thou to Pharaoh, for he has indeed transgressed all bounds.\"","transliteration":"Ithhab ila firAAawna innahu tagha"},{"arabic":"قَالَ رَبِّ ٱشْرَحْ لِى صَدْرِى","translation":"(Moses) said: \"O my Lord! expand me my breast;","transliteration":"Qala rabbi ishrah lee sadree"},{"arabic":"وَيَسِّرْ لِىٓ أَمْرِى","translation":"\"Ease my task for me;","transliteration":"Wayassir lee amree"},{"arabic":"وَٱحْلُلْ عُقْدَةً مِّن لِّسَانِى","translation":"\"And remove the impediment from my speech,","transliteration":"Wahlul AAuqdatan min lisanee"},{"arabic":"يَفْقَهُوا۟ قَوْلِى","translation":"\"So they may understand what I say:","transliteration":"Yafqahoo qawlee"},{"arabic":"وَٱجْعَل لِّى وَزِيرًا مِّنْ أَهْلِى","translation":"\"And give me a Minister from my family,","transliteration":"WajAAal lee wazeeran min ahlee"},{"arabic":"هَـٰرُونَ أَخِى","translation":"\"Aaron, my brother;","transliteration":"Haroona akhee"},{"arabic":"ٱشْدُدْ بِهِۦٓ أَزْرِى","translation":"\"Add to my strength through him,","transliteration":"Oshdud bihi azree"},{"arabic":"وَأَشْرِكْهُ فِىٓ أَمْرِى","translation":"\"And make him share my task:","transliteration":"Waashrik-hu fee amree"},{"arabic":"كَىْ نُسَبِّحَكَ كَثِيرًا","translation":"\"That we may celebrate Thy praise without stint,","transliteration":"Kay nusabbihaka katheera"},{"arabic":"وَنَذْكُرَكَ كَثِيرًا","translation":"\"And remember Thee without stint:","transliteration":"Wanathkuraka katheera"},{"arabic":"إِنَّكَ كُنتَ بِنَا بَصِيرًا","translation":"\"For Thou art He that (ever) regardeth us.\"","transliteration":"Innaka kunta bina baseera"},{"arabic":"قَالَ قَدْ أُوتِيتَ سُؤْلَكَ يَـٰمُوسَىٰ","translation":"(Allah) said: \"Granted is thy prayer, O Moses!\"","transliteration":"Qala qad ooteeta su/laka yamoosa"},{"arabic":"وَلَقَدْ مَنَنَّا عَلَيْكَ مَرَّةً أُخْرَىٰٓ","translation":"\"And indeed We conferred a favour on thee another time (before).","transliteration":"Walaqad mananna AAalayka marratanokhra"},{"arabic":"إِذْ أَوْحَيْنَآ إِلَىٰٓ أُمِّكَ مَا يُوحَىٰٓ","translation":"\"Behold! We sent to thy mother, by inspiration, the message:","transliteration":"Ith awhayna ilaommika ma yooha"},{"arabic":"أَنِ ٱقْذِفِيهِ فِى ٱلتَّابُوتِ فَٱقْذِفِيهِ فِى ٱلْيَمِّ فَلْيُلْقِهِ ٱلْيَمُّ بِٱلسَّاحِلِ يَأْخُذْهُ عَدُوٌّ لِّى وَعَدُوٌّ لَّهُۥ ۚ وَأَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّى وَلِتُصْنَعَ عَلَىٰ عَيْنِىٓ","translation":"\"'Throw (the child) into the chest, and throw (the chest) into the river: the river will cast him up on the bank, and he will be taken up by one who is an enemy to Me and an enemy to him': But I cast (the garment of) love over thee from Me: and (this) in order that thou mayest be reared under Mine eye.","transliteration":"Ani iqthifeehi fee attabootifaqthifeehi fee alyammi falyulqihi alyammu bissahiliya/khuthhu AAaduwwun lee waAAaduwwun lahu waalqaytuAAalayka mahabbatan minnee walitusnaAAa AAalaAAaynee"},{"arabic":"إِذْ تَمْشِىٓ أُخْتُكَ فَتَقُولُ هَلْ أَدُلُّكُمْ عَلَىٰ مَن يَكْفُلُهُۥ ۖ فَرَجَعْنَـٰكَ إِلَىٰٓ أُمِّكَ كَىْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ ۚ وَقَتَلْتَ نَفْسًا فَنَجَّيْنَـٰكَ مِنَ ٱلْغَمِّ وَفَتَنَّـٰكَ فُتُونًا ۚ فَلَبِثْتَ سِنِينَ فِىٓ أَهْلِ مَدْيَنَ ثُمَّ جِئْتَ عَلَىٰ قَدَرٍ يَـٰمُوسَىٰ","translation":"\"Behold! thy sister goeth forth and saith, 'shall I show you one who will nurse and rear the (child)?' So We brought thee back to thy mother, that her eye might be cooled and she should not grieve. Then thou didst slay a man, but We saved thee from trouble, and We tried thee in various ways. Then didst thou tarry a number of years with the people of Midian. Then didst thou come hither as ordained, O Moses!","transliteration":"Ith tamshee okhtuka fataqoolu haladullukum AAala man yakfuluhu farajaAAnaka ilaommika kay taqarra AAaynuha wala tahzanawaqatalta nafsan fanajjaynaka mina alghammi wafatannakafutoonan falabithta sineena fee ahli madyana thumma ji/ta AAalaqadarin ya moosa"},{"arabic":"وَٱصْطَنَعْتُكَ لِنَفْسِى","translation":"\"And I have prepared thee for Myself (for service)\"..","transliteration":"WastanaAAtuka linafsee"},{"arabic":"ٱذْهَبْ أَنتَ وَأَخُوكَ بِـَٔايَـٰتِى وَلَا تَنِيَا فِى ذِكْرِى","translation":"\"Go, thou and thy brother, with My Signs, and slacken not, either of you, in keeping Me in remembrance.","transliteration":"Ithhab anta waakhooka bi-ayateewala taniya fee thikree"},{"arabic":"ٱذْهَبَآ إِلَىٰ فِرْعَوْنَ إِنَّهُۥ طَغَىٰ","translation":"\"Go, both of you, to Pharaoh, for he has indeed transgressed all bounds;","transliteration":"Ithhaba ila firAAawnainnahu tagha"},{"arabic":"فَقُولَا لَهُۥ قَوْلًا لَّيِّنًا لَّعَلَّهُۥ يَتَذَكَّرُ أَوْ يَخْشَىٰ","translation":"\"But speak to him mildly; perchance he may take warning or fear (Allah).\"","transliteration":"Faqoola lahu qawlan layyinanlaAAallahu yatathakkaru aw yakhsha"},{"arabic":"قَالَا رَبَّنَآ إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَآ أَوْ أَن يَطْغَىٰ","translation":"They (Moses and Aaron) said: \"Our Lord! We fear lest he hasten with insolence against us, or lest he transgress all bounds.\"","transliteration":"Qala rabbana innananakhafu an yafruta AAalayna aw an yatgha"},{"arabic":"قَالَ لَا تَخَافَآ ۖ إِنَّنِى مَعَكُمَآ أَسْمَعُ وَأَرَىٰ","translation":"He said: \"Fear not: for I am with you: I hear and see (everything).","transliteration":"Qala la takhafainnanee maAAakuma asmaAAu waara"},{"arabic":"فَأْتِيَاهُ فَقُولَآ إِنَّا رَسُولَا رَبِّكَ فَأَرْسِلْ مَعَنَا بَنِىٓ إِسْرَٰٓءِيلَ وَلَا تُعَذِّبْهُمْ ۖ قَدْ جِئْنَـٰكَ بِـَٔايَةٍ مِّن رَّبِّكَ ۖ وَٱلسَّلَـٰمُ عَلَىٰ مَنِ ٱتَّبَعَ ٱلْهُدَىٰٓ","translation":"\"So go ye both to him, and say, 'Verily we are messengers sent by thy Lord: Send forth, therefore, the Children of Israel with us, and afflict them not: with a Sign, indeed, have we come from thy Lord! and peace to all who follow guidance!","transliteration":"Fa/tiyahu faqoola innarasoola rabbika faarsil maAAana banee isra-eelawala tuAAaththibhum qad ji/naka bi-ayatinmin rabbika wassalamu AAala mani ittabaAAaalhuda"},{"arabic":"إِنَّا قَدْ أُوحِىَ إِلَيْنَآ أَنَّ ٱلْعَذَابَ عَلَىٰ مَن كَذَّبَ وَتَوَلَّىٰ","translation":"\"'Verily it has been revealed to us that the Penalty (awaits) those who reject and turn away.'\"","transliteration":"Inna qad oohiya ilaynaanna alAAathaba AAala man kaththaba watawalla"},{"arabic":"قَالَ فَمَن رَّبُّكُمَا يَـٰمُوسَىٰ","translation":"(When this message was delivered), (Pharaoh) said: \"Who, then, O Moses, is the Lord of you two?\"","transliteration":"Qala faman rabbukuma yamoosa"},{"arabic":"قَالَ رَبُّنَا ٱلَّذِىٓ أَعْطَىٰ كُلَّ شَىْءٍ خَلْقَهُۥ ثُمَّ هَدَىٰ","translation":"He said: \"Our Lord is He Who gave to each (created) thing its form and nature, and further, gave (it) guidance.\"","transliteration":"Qala rabbuna allatheeaAAta kulla shay-in khalqahu thumma hada"},{"arabic":"قَالَ فَمَا بَالُ ٱلْقُرُونِ ٱلْأُولَىٰ","translation":"(Pharaoh) said: \"What then is the condition of previous generations?\"","transliteration":"Qala fama balualqurooni al-oola"},{"arabic":"قَالَ عِلْمُهَا عِندَ رَبِّى فِى كِتَـٰبٍ ۖ لَّا يَضِلُّ رَبِّى وَلَا يَنسَى","translation":"He replied: \"The knowledge of that is with my Lord, duly recorded: my Lord never errs, nor forgets,-","transliteration":"Qala AAilmuha AAinda rabbeefee kitabin la yadillu rabbee walayansa"},{"arabic":"ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ مَهْدًا وَسَلَكَ لَكُمْ فِيهَا سُبُلًا وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَأَخْرَجْنَا بِهِۦٓ أَزْوَٰجًا مِّن نَّبَاتٍ شَتَّىٰ","translation":"\"He Who has, made for you the earth like a carpet spread out; has enabled you to go about therein by roads (and channels); and has sent down water from the sky.\" With it have We produced diverse pairs of plants each separate from the others.","transliteration":"Allathee jaAAala lakumu al-ardamahdan wasalaka lakum feeha subulan waanzala mina assama-imaan faakhrajna bihi azwajan min nabatinshatta"},{"arabic":"كُلُوا۟ وَٱرْعَوْا۟ أَنْعَـٰمَكُمْ ۗ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّأُو۟لِى ٱلنُّهَىٰ","translation":"Eat (for yourselves) and pasture your cattle: verily, in this are Signs for men endued with understanding.","transliteration":"Kuloo warAAaw anAAamakum innafee thalika laayatin li-olee annuha"},{"arabic":"۞ مِنْهَا خَلَقْنَـٰكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَىٰ","translation":"From the (earth) did We create you, and into it shall We return you, and from it shall We bring you out once again.","transliteration":"Minha khalaqnakum wafeehanuAAeedukum waminha nukhrijukum taratan okhra"},{"arabic":"وَلَقَدْ أَرَيْنَـٰهُ ءَايَـٰتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ","translation":"And We showed Pharaoh all Our Signs, but he did reject and refuse.","transliteration":"Walaqad araynahu ayatinakullaha fakaththaba waaba"},{"arabic":"قَالَ أَجِئْتَنَا لِتُخْرِجَنَا مِنْ أَرْضِنَا بِسِحْرِكَ يَـٰمُوسَىٰ","translation":"He said: \"Hast thou come to drive us out of our land with thy magic, O Moses?","transliteration":"Qala aji/tana litukhrijanamin ardina bisihrika ya moosa"},{"arabic":"فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِّثْلِهِۦ فَٱجْعَلْ بَيْنَنَا وَبَيْنَكَ مَوْعِدًا لَّا نُخْلِفُهُۥ نَحْنُ وَلَآ أَنتَ مَكَانًا سُوًى","translation":"\"But we can surely produce magic to match thine! So make a tryst between us and thee, which we shall not fail to keep - neither we nor thou - in a place where both shall have even chances.\"","transliteration":"Falana/tiyannaka bisihrin mithlihi fajAAalbaynana wabaynaka mawAAidan la nukhlifuhu nahnuwala anta makanan suwa"},{"arabic":"قَالَ مَوْعِدُكُمْ يَوْمُ ٱلزِّينَةِ وَأَن يُحْشَرَ ٱلنَّاسُ ضُحًى","translation":"Moses said: \"Your tryst is the Day of the Festival, and let the people be assembled when the sun is well up.\"","transliteration":"Qala mawAAidukum yawmu azzeenatiwaan yuhshara annasu duha"},{"arabic":"فَتَوَلَّىٰ فِرْعَوْنُ فَجَمَعَ كَيْدَهُۥ ثُمَّ أَتَىٰ","translation":"So Pharaoh withdrew: He concerted his plan, and then came (back).","transliteration":"Fatawalla firAAawnu fajamaAAa kaydahuthumma ata"},{"arabic":"قَالَ لَهُم مُّوسَىٰ وَيْلَكُمْ لَا تَفْتَرُوا۟ عَلَى ٱللَّهِ كَذِبًا فَيُسْحِتَكُم بِعَذَابٍ ۖ وَقَدْ خَابَ مَنِ ٱفْتَرَىٰ","translation":"Moses said to him: Woe to you! Forge not ye a lie against Allah, lest He destroy you (at once) utterly by chastisement: the forger must suffer frustration!\"","transliteration":"Qala lahum moosa waylakum lataftaroo AAala Allahi kathiban fayushitakumbiAAathabin waqad khaba mani iftara"},{"arabic":"فَتَنَـٰزَعُوٓا۟ أَمْرَهُم بَيْنَهُمْ وَأَسَرُّوا۟ ٱلنَّجْوَىٰ","translation":"So they disputed, one with another, over their affair, but they kept their talk secret.","transliteration":"FatanazaAAoo amrahum baynahumwaasarroo annajwa"},{"arabic":"قَالُوٓا۟ إِنْ هَـٰذَٰنِ لَسَـٰحِرَٰنِ يُرِيدَانِ أَن يُخْرِجَاكُم مِّنْ أَرْضِكُم بِسِحْرِهِمَا وَيَذْهَبَا بِطَرِيقَتِكُمُ ٱلْمُثْلَىٰ","translation":"They said: \"These two are certainly (expert) magicians: their object is to drive you out from your land with their magic, and to do away with your most cherished institutions.","transliteration":"Qaloo in hathani lasahiraniyureedani an yukhrijakum min ardikum bisihrihimawayathhaba bitareeqatikumu almuthla"},{"arabic":"فَأَجْمِعُوا۟ كَيْدَكُمْ ثُمَّ ٱئْتُوا۟ صَفًّا ۚ وَقَدْ أَفْلَحَ ٱلْيَوْمَ مَنِ ٱسْتَعْلَىٰ","translation":"\"Therefore concert your plan, and then assemble in (serried) ranks: He wins (all along) today who gains the upper hand.\"","transliteration":"FaajmiAAoo kaydakum thumma i/too saffanwaqad aflaha alyawma mani istaAAla"},{"arabic":"قَالُوا۟ يَـٰمُوسَىٰٓ إِمَّآ أَن تُلْقِىَ وَإِمَّآ أَن نَّكُونَ أَوَّلَ مَنْ أَلْقَىٰ","translation":"They said: \"O Moses! whether wilt thou that thou throw (first) or that we be the first to throw?\"","transliteration":"Qaloo ya moosa immaan tulqiya wa-imma an nakoona awwala man alqa"},{"arabic":"قَالَ بَلْ أَلْقُوا۟ ۖ فَإِذَا حِبَالُهُمْ وَعِصِيُّهُمْ يُخَيَّلُ إِلَيْهِ مِن سِحْرِهِمْ أَنَّهَا تَسْعَىٰ","translation":"He said, \"Nay, throw ye first!\" Then behold their ropes and their rods-so it seemed to him on account of their magic - began to be in lively motion!","transliteration":"Qala bal alqoo fa-itha hibaluhumwaAAisiyyuhum yukhayyalu ilayhi min sihrihim annahatasAAa"},{"arabic":"فَأَوْجَسَ فِى نَفْسِهِۦ خِيفَةً مُّوسَىٰ","translation":"So Moses conceived in his mind a (sort of) fear.","transliteration":"Faawjasa fee nafsihi kheefatan moosa"},{"arabic":"قُلْنَا لَا تَخَفْ إِنَّكَ أَنتَ ٱلْأَعْلَىٰ","translation":"We said: \"Fear not! for thou hast indeed the upper hand:","transliteration":"Qulna la takhaf innaka antaal-aAAla"},{"arabic":"وَأَلْقِ مَا فِى يَمِينِكَ تَلْقَفْ مَا صَنَعُوٓا۟ ۖ إِنَّمَا صَنَعُوا۟ كَيْدُ سَـٰحِرٍ ۖ وَلَا يُفْلِحُ ٱلسَّاحِرُ حَيْثُ أَتَىٰ","translation":"\"Throw that which is in thy right hand: Quickly will it swallow up that which they have faked what they have faked is but a magician's trick: and the magician thrives not, (no matter) where he goes.\"","transliteration":"Waalqi ma fee yameenika talqaf masanaAAoo innama sanaAAoo kaydu sahirinwala yuflihu assahiru haythuata"},{"arabic":"فَأُلْقِىَ ٱلسَّحَرَةُ سُجَّدًا قَالُوٓا۟ ءَامَنَّا بِرَبِّ هَـٰرُونَ وَمُوسَىٰ","translation":"So the magicians were thrown down to prostration: they said, \"We believe in the Lord of Aaron and Moses\".","transliteration":"Faolqiya assaharatu sujjadanqaloo amanna birabbi haroona wamoosa"},{"arabic":"قَالَ ءَامَنتُمْ لَهُۥ قَبْلَ أَنْ ءَاذَنَ لَكُمْ ۖ إِنَّهُۥ لَكَبِيرُكُمُ ٱلَّذِى عَلَّمَكُمُ ٱلسِّحْرَ ۖ فَلَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَـٰفٍ وَلَأُصَلِّبَنَّكُمْ فِى جُذُوعِ ٱلنَّخْلِ وَلَتَعْلَمُنَّ أَيُّنَآ أَشَدُّ عَذَابًا وَأَبْقَىٰ","translation":"(Pharaoh) said: \"Believe ye in Him before I give you permission? Surely this must be your leader, who has taught you magic! be sure I will cut off your hands and feet on opposite sides, and I will have you crucified on trunks of palm-trees: so shall ye know for certain, which of us can give the more severe and the more lasting punishment!\"","transliteration":"Qala amantum lahu qabla an athanalakum innahu lakabeerukumu allathee AAallamakumu assihrafalaoqattiAAanna aydiyakum waarjulakum min khilafinwalaosallibannakum fee juthooAAi annakhliwalataAAlamunna ayyuna ashaddu AAathaban waabqa"},{"arabic":"قَالُوا۟ لَن نُّؤْثِرَكَ عَلَىٰ مَا جَآءَنَا مِنَ ٱلْبَيِّنَـٰتِ وَٱلَّذِى فَطَرَنَا ۖ فَٱقْضِ مَآ أَنتَ قَاضٍ ۖ إِنَّمَا تَقْضِى هَـٰذِهِ ٱلْحَيَوٰةَ ٱلدُّنْيَآ","translation":"They said: \"Never shall we regard thee as more than the Clear Signs that have come to us, or than Him Who created us! so decree whatever thou desirest to decree: for thou canst only decree (touching) the life of this world.","transliteration":"Qaloo lan nu/thiraka AAala majaana mina albayyinati wallatheefatarana faqdi ma anta qadininnama taqdee hathihi alhayataaddunya"},{"arabic":"إِنَّآ ءَامَنَّا بِرَبِّنَا لِيَغْفِرَ لَنَا خَطَـٰيَـٰنَا وَمَآ أَكْرَهْتَنَا عَلَيْهِ مِنَ ٱلسِّحْرِ ۗ وَٱللَّهُ خَيْرٌ وَأَبْقَىٰٓ","translation":"\"For us, we have believed in our Lord: may He forgive us our faults, and the magic to which thou didst compel us: for Allah is Best and Most Abiding.\"","transliteration":"Inna amanna birabbinaliyaghfira lana khatayana wamaakrahtana AAalayhi mina assihri wallahukhayrun waabqa"},{"arabic":"إِنَّهُۥ مَن يَأْتِ رَبَّهُۥ مُجْرِمًا فَإِنَّ لَهُۥ جَهَنَّمَ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ","translation":"Verily he who comes to his Lord as a sinner (at Judgment),- for him is Hell: therein shall he neither die nor live.","transliteration":"Innahu man ya/ti rabbahu mujriman fa-innalahu jahannama la yamootu feeha wala yahya"},{"arabic":"وَمَن يَأْتِهِۦ مُؤْمِنًا قَدْ عَمِلَ ٱلصَّـٰلِحَـٰتِ فَأُو۟لَـٰٓئِكَ لَهُمُ ٱلدَّرَجَـٰتُ ٱلْعُلَىٰ","translation":"But such as come to Him as Believers who have worked righteous deeds,- for them are ranks exalted,-","transliteration":"Waman ya/tihi mu/minan qad AAamila assalihatifaola-ika lahumu addarajatu alAAula"},{"arabic":"جَنَّـٰتُ عَدْنٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ وَذَٰلِكَ جَزَآءُ مَن تَزَكَّىٰ","translation":"Gardens of Eternity, beneath which flow rivers: they will dwell therein for aye: such is the reward of those who purify themselves (from evil).","transliteration":"Jannatu AAadnin tajree min tahtihaal-anharu khalideena feeha wathalikajazao man tazakka"},{"arabic":"وَلَقَدْ أَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ أَنْ أَسْرِ بِعِبَادِى فَٱضْرِبْ لَهُمْ طَرِيقًا فِى ٱلْبَحْرِ يَبَسًا لَّا تَخَـٰفُ دَرَكًا وَلَا تَخْشَىٰ","translation":"We sent an inspiration to Moses: \"Travel by night with My servants, and strike a dry path for them through the sea, without fear of being overtaken (by Pharaoh) and without (any other) fear.\"","transliteration":"Walaqad awhayna ilamoosa an asri biAAibadee fadriblahum tareeqan fee albahri yabasan la takhafudarakan wala takhsha"},{"arabic":"فَأَتْبَعَهُمْ فِرْعَوْنُ بِجُنُودِهِۦ فَغَشِيَهُم مِّنَ ٱلْيَمِّ مَا غَشِيَهُمْ","translation":"Then Pharaoh pursued them with his forces, but the waters completely overwhelmed them and covered them up.","transliteration":"FaatbaAAahum firAAawnu bijunoodihifaghashiyahum mina alyammi ma ghashiyahum"},{"arabic":"وَأَضَلَّ فِرْعَوْنُ قَوْمَهُۥ وَمَا هَدَىٰ","translation":"Pharaoh led his people astray instead of leading them aright.","transliteration":"Waadalla firAAawnu qawmahu wamahada"},{"arabic":"يَـٰبَنِىٓ إِسْرَٰٓءِيلَ قَدْ أَنجَيْنَـٰكُم مِّنْ عَدُوِّكُمْ وَوَٰعَدْنَـٰكُمْ جَانِبَ ٱلطُّورِ ٱلْأَيْمَنَ وَنَزَّلْنَا عَلَيْكُمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ","translation":"O ye Children of Israel! We delivered you from your enemy, and We made a Covenant with you on the right side of Mount (Sinai), and We sent down to you Manna and quails:","transliteration":"Ya banee isra-eela qad anjaynakummin AAaduwwikum wawaAAadnakum janiba attoorial-aymana wanazzalna AAalaykumu almanna wassalwa"},{"arabic":"كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ وَلَا تَطْغَوْا۟ فِيهِ فَيَحِلَّ عَلَيْكُمْ غَضَبِى ۖ وَمَن يَحْلِلْ عَلَيْهِ غَضَبِى فَقَدْ هَوَىٰ","translation":"(Saying): \"Eat of the good things We have provided for your sustenance, but commit no excess therein, lest My Wrath should justly descend on you: and those on whom descends My Wrath do perish indeed!","transliteration":"Kuloo min tayyibati marazaqnakum wala tatghaw feehi fayahillaAAalaykum ghadabee waman yahlil AAalayhi ghadabeefaqad hawa"},{"arabic":"وَإِنِّى لَغَفَّارٌ لِّمَن تَابَ وَءَامَنَ وَعَمِلَ صَـٰلِحًا ثُمَّ ٱهْتَدَىٰ","translation":"\"But, without doubt, I am (also) He that forgives again and again, to those who repent, believe, and do right, who,- in fine, are ready to receive true guidance.\"","transliteration":"Wa-innee laghaffarun liman tabawaamana waAAamila salihan thumma ihtada"},{"arabic":"۞ وَمَآ أَعْجَلَكَ عَن قَوْمِكَ يَـٰمُوسَىٰ","translation":"(When Moses was up on the Mount, Allah said:) \"What made thee hasten in advance of thy people, O Moses?\"","transliteration":"Wama aAAjalaka AAan qawmika yamoosa"},{"arabic":"قَالَ هُمْ أُو۟لَآءِ عَلَىٰٓ أَثَرِى وَعَجِلْتُ إِلَيْكَ رَبِّ لِتَرْضَىٰ","translation":"He replied: \"Behold, they are close on my footsteps: I hastened to thee, O my Lord, to please thee.\"","transliteration":"Qala hum ola-i AAalaatharee waAAajiltu ilayka rabbi litarda"},{"arabic":"قَالَ فَإِنَّا قَدْ فَتَنَّا قَوْمَكَ مِنۢ بَعْدِكَ وَأَضَلَّهُمُ ٱلسَّامِرِىُّ","translation":"(Allah) said: \"We have tested thy people in thy absence: the Samiri has led them astray.\"","transliteration":"Qala fa-inna qad fatannaqawmaka min baAAdika waadallahumu assamiriy"},{"arabic":"فَرَجَعَ مُوسَىٰٓ إِلَىٰ قَوْمِهِۦ غَضْبَـٰنَ أَسِفًا ۚ قَالَ يَـٰقَوْمِ أَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا ۚ أَفَطَالَ عَلَيْكُمُ ٱلْعَهْدُ أَمْ أَرَدتُّمْ أَن يَحِلَّ عَلَيْكُمْ غَضَبٌ مِّن رَّبِّكُمْ فَأَخْلَفْتُم مَّوْعِدِى","translation":"So Moses returned to his people in a state of indignation and sorrow. He said: \"O my people! did not your Lord make a handsome promise to you? Did then the promise seem to you long (in coming)? Or did ye desire that Wrath should descend from your Lord on you, and so ye broke your promise to me?\"","transliteration":"FarajaAAa moosa ila qawmihighadbana asifan qala ya qawmi alamyaAAidkum rabbukum waAAdan hasanan afatalaAAalaykumu alAAahdu am aradtum an yahilla AAalaykum ghadabunmin rabbikum faakhlaftum mawAAidee"},{"arabic":"قَالُوا۟ مَآ أَخْلَفْنَا مَوْعِدَكَ بِمَلْكِنَا وَلَـٰكِنَّا حُمِّلْنَآ أَوْزَارًا مِّن زِينَةِ ٱلْقَوْمِ فَقَذَفْنَـٰهَا فَكَذَٰلِكَ أَلْقَى ٱلسَّامِرِىُّ","translation":"They said: \"We broke not the promise to thee, as far as lay in our power: but we were made to carry the weight of the ornaments of the (whole) people, and we threw them (into the fire), and that was what the Samiri suggested.","transliteration":"Qaloo ma akhlafnamawAAidaka bimalkina walakinna hummilnaawzaran min zeenati alqawmi faqathafnahafakathalika alqa assamiriy"},{"arabic":"فَأَخْرَجَ لَهُمْ عِجْلًا جَسَدًا لَّهُۥ خُوَارٌ فَقَالُوا۟ هَـٰذَآ إِلَـٰهُكُمْ وَإِلَـٰهُ مُوسَىٰ فَنَسِىَ","translation":"\"Then he brought out (of the fire) before the (people) the image of a calf: It seemed to low: so they said: This is your god, and the god of Moses, but (Moses) has forgotten!\"","transliteration":"Faakhraja lahum AAijlan jasadan lahu khuwarunfaqaloo hatha ilahukum wa-ilahu moosafanasiy"},{"arabic":"أَفَلَا يَرَوْنَ أَلَّا يَرْجِعُ إِلَيْهِمْ قَوْلًا وَلَا يَمْلِكُ لَهُمْ ضَرًّا وَلَا نَفْعًا","translation":"Could they not see that it could not return them a word (for answer), and that it had no power either to harm them or to do them good?","transliteration":"Afala yarawna alla yarjiAAuilayhim qawlan wala yamliku lahum darran walanafAAa"},{"arabic":"وَلَقَدْ قَالَ لَهُمْ هَـٰرُونُ مِن قَبْلُ يَـٰقَوْمِ إِنَّمَا فُتِنتُم بِهِۦ ۖ وَإِنَّ رَبَّكُمُ ٱلرَّحْمَـٰنُ فَٱتَّبِعُونِى وَأَطِيعُوٓا۟ أَمْرِى","translation":"Aaron had already, before this said to them: \"O my people! ye are being tested in this: for verily your Lord is (Allah) Most Gracious; so follow me and obey my command.\"","transliteration":"Walaqad qala lahum haroonu minqablu ya qawmi innama futintum bihi wa-innarabbakumu arrahmanu fattabiAAooneewaateeAAoo amree"},{"arabic":"قَالُوا۟ لَن نَّبْرَحَ عَلَيْهِ عَـٰكِفِينَ حَتَّىٰ يَرْجِعَ إِلَيْنَا مُوسَىٰ","translation":"They had said: \"We will not abandon this cult, but we will devote ourselves to it until Moses returns to us.\"","transliteration":"Qaloo lan nabraha AAalayhi AAakifeenahatta yarjiAAa ilayna moosa"},{"arabic":"قَالَ يَـٰهَـٰرُونُ مَا مَنَعَكَ إِذْ رَأَيْتَهُمْ ضَلُّوٓا۟","translation":"(Moses) said: \"O Aaron! what kept thee back, when thou sawest them going wrong,","transliteration":"Qala ya haroonu mamanaAAaka ith raaytahum dalloo"},{"arabic":"أَلَّا تَتَّبِعَنِ ۖ أَفَعَصَيْتَ أَمْرِى","translation":"\"From following me? Didst thou then disobey my order?\"","transliteration":"Alla tattabiAAani afaAAasaytaamree"},{"arabic":"قَالَ يَبْنَؤُمَّ لَا تَأْخُذْ بِلِحْيَتِى وَلَا بِرَأْسِىٓ ۖ إِنِّى خَشِيتُ أَن تَقُولَ فَرَّقْتَ بَيْنَ بَنِىٓ إِسْرَٰٓءِيلَ وَلَمْ تَرْقُبْ قَوْلِى","translation":"(Aaron) replied: \"O son of my mother! Seize (me) not by my beard nor by (the hair of) my head! Truly I feared lest thou shouldst say, 'Thou has caused a division among the children of Israel, and thou didst not respect my word!'\"","transliteration":"Qala yabnaomma la ta/khuthbilihyatee wala bira/see innee khasheetu an taqoolafarraqta bayna banee isra-eela walam tarqub qawlee"},{"arabic":"قَالَ فَمَا خَطْبُكَ يَـٰسَـٰمِرِىُّ","translation":"(Moses) said: \"What then is thy case, O Samiri?\"","transliteration":"Qala fama khatbuka yasamiriy"},{"arabic":"قَالَ بَصُرْتُ بِمَا لَمْ يَبْصُرُوا۟ بِهِۦ فَقَبَضْتُ قَبْضَةً مِّنْ أَثَرِ ٱلرَّسُولِ فَنَبَذْتُهَا وَكَذَٰلِكَ سَوَّلَتْ لِى نَفْسِى","translation":"He replied: \"I saw what they saw not: so I took a handful (of dust) from the footprint of the Messenger, and threw it (into the calf): thus did my soul suggest to me.\"","transliteration":"Qala basurtu bima lamyabsuroo bihi faqabadtu qabdatan min athariarrasooli fanabathtuha wakathalikasawwalat lee nafsee"},{"arabic":"قَالَ فَٱذْهَبْ فَإِنَّ لَكَ فِى ٱلْحَيَوٰةِ أَن تَقُولَ لَا مِسَاسَ ۖ وَإِنَّ لَكَ مَوْعِدًا لَّن تُخْلَفَهُۥ ۖ وَٱنظُرْ إِلَىٰٓ إِلَـٰهِكَ ٱلَّذِى ظَلْتَ عَلَيْهِ عَاكِفًا ۖ لَّنُحَرِّقَنَّهُۥ ثُمَّ لَنَنسِفَنَّهُۥ فِى ٱلْيَمِّ نَسْفًا","translation":"(Moses) said: \"Get thee gone! but thy (punishment) in this life will be that thou wilt say, 'touch me not'; and moreover (for a future penalty) thou hast a promise that will not fail: Now look at thy god, of whom thou hast become a devoted worshipper: We will certainly (melt) it in a blazing fire and scatter it broadcast in the sea!\"","transliteration":"Qala fathhab fa-innalaka fee alhayati an taqoola la misasawa-inna laka mawAAidan lan tukhlafahu wanthurila ilahika allathee thaltaAAalayhi AAakifan lanuharriqannahu thummalanansifannahu fee alyammi nasfa"},{"arabic":"إِنَّمَآ إِلَـٰهُكُمُ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ۚ وَسِعَ كُلَّ شَىْءٍ عِلْمًا","translation":"But the god of you all is the One Allah: there is no god but He: all things He comprehends in His knowledge.","transliteration":"Innama ilahukumu Allahuallathee la ilaha illa huwa wasiAAakulla shay-in AAilma"},{"arabic":"كَذَٰلِكَ نَقُصُّ عَلَيْكَ مِنْ أَنۢبَآءِ مَا قَدْ سَبَقَ ۚ وَقَدْ ءَاتَيْنَـٰكَ مِن لَّدُنَّا ذِكْرًا","translation":"Thus do We relate to thee some stories of what happened before: for We have sent thee a Message from Our own Presence.","transliteration":"Kathalika naqussu AAalayka minanba-i ma qad sabaqa waqad ataynakamin ladunna thikra"},{"arabic":"مَّنْ أَعْرَضَ عَنْهُ فَإِنَّهُۥ يَحْمِلُ يَوْمَ ٱلْقِيَـٰمَةِ وِزْرًا","translation":"If any do turn away therefrom, verily they will bear a burden on the Day of judgment;","transliteration":"Man aAArada AAanhu fa-innahu yahmiluyawma alqiyamati wizra"},{"arabic":"خَـٰلِدِينَ فِيهِ ۖ وَسَآءَ لَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ حِمْلًا","translation":"They will abide in this (state): and grievous will the burden be to them on that Day,-","transliteration":"Khalideena feehi wasaa lahumyawma alqiyamati himla"},{"arabic":"يَوْمَ يُنفَخُ فِى ٱلصُّورِ ۚ وَنَحْشُرُ ٱلْمُجْرِمِينَ يَوْمَئِذٍ زُرْقًا","translation":"The Day when the Trumpet will be sounded: that Day, We shall gather the sinful, blear-eyed (with terror).","transliteration":"Yawma yunfakhu fee assooriwanahshuru almujrimeena yawma-ithin zurqa"},{"arabic":"يَتَخَـٰفَتُونَ بَيْنَهُمْ إِن لَّبِثْتُمْ إِلَّا عَشْرًا","translation":"In whispers will they consult each other: \"Yet tarried not longer than ten (Days);","transliteration":"Yatakhafatoona baynahum in labithtumilla AAashra"},{"arabic":"نَّحْنُ أَعْلَمُ بِمَا يَقُولُونَ إِذْ يَقُولُ أَمْثَلُهُمْ طَرِيقَةً إِن لَّبِثْتُمْ إِلَّا يَوْمًا","translation":"We know best what they will say, when their leader most eminent in conduct will say: \"Ye tarried not longer than a day!\"","transliteration":"Nahnu aAAlamu bima yaqooloonaith yaqoolu amthaluhum tareeqatan in labithtum illayawma"},{"arabic":"وَيَسْـَٔلُونَكَ عَنِ ٱلْجِبَالِ فَقُلْ يَنسِفُهَا رَبِّى نَسْفًا","translation":"They ask thee concerning the Mountains: say, \"My Lord will uproot them and scatter them as dust;","transliteration":"Wayas-aloonaka AAani aljibali faqulyansifuha rabbee nasfa"},{"arabic":"فَيَذَرُهَا قَاعًا صَفْصَفًا","translation":"\"He will leave them as plains smooth and level;","transliteration":"Fayatharuha qaAAan safsafa"},{"arabic":"لَّا تَرَىٰ فِيهَا عِوَجًا وَلَآ أَمْتًا","translation":"\"Nothing crooked or curved wilt thou see in their place.\"","transliteration":"La tara feeha AAiwajanwala amta"},{"arabic":"يَوْمَئِذٍ يَتَّبِعُونَ ٱلدَّاعِىَ لَا عِوَجَ لَهُۥ ۖ وَخَشَعَتِ ٱلْأَصْوَاتُ لِلرَّحْمَـٰنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا","translation":"On that Day will they follow the Caller (straight): no crookedness (can they show) him: all sounds shall humble themselves in the Presence of (Allah) Most Gracious: nothing shalt thou hear but the tramp of their feet (as they march).","transliteration":"Yawma-ithin yattabiAAoona addaAAiyala AAiwaja lahu wakhashaAAati al-aswatu lirrahmanifala tasmaAAu illa hamsa"},{"arabic":"يَوْمَئِذٍ لَّا تَنفَعُ ٱلشَّفَـٰعَةُ إِلَّا مَنْ أَذِنَ لَهُ ٱلرَّحْمَـٰنُ وَرَضِىَ لَهُۥ قَوْلًا","translation":"On that Day shall no intercession avail except for those for whom permission has been granted by (Allah) Most Gracious and whose word is acceptable to Him.","transliteration":"Yawma-ithin la tanfaAAu ashshafaAAatuilla man athina lahu arrahmanuwaradiya lahu qawla"},{"arabic":"يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِهِۦ عِلْمًا","translation":"He knows what (appears to His creatures as) before or after or behind them: but they shall not compass it with their knowledge.","transliteration":"YaAAlamu ma bayna aydeehim wamakhalfahum wala yuheetoona bihi AAilma"},{"arabic":"۞ وَعَنَتِ ٱلْوُجُوهُ لِلْحَىِّ ٱلْقَيُّومِ ۖ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا","translation":"(All) faces shall be humbled before (Him) - the Living, the Self-Subsisting, Eternal: hopeless indeed will be the man that carries iniquity (on his back).","transliteration":"WaAAanati alwujoohu lilhayyialqayyoomi waqad khaba man hamala thulma"},{"arabic":"وَمَن يَعْمَلْ مِنَ ٱلصَّـٰلِحَـٰتِ وَهُوَ مُؤْمِنٌ فَلَا يَخَافُ ظُلْمًا وَلَا هَضْمًا","translation":"But he who works deeds of righteousness, and has faith, will have no fear of harm nor of any curtailment (of what is his due).","transliteration":"Waman yaAAmal mina assalihatiwahuwa mu/minun fala yakhafu thulmanwala hadma"},{"arabic":"وَكَذَٰلِكَ أَنزَلْنَـٰهُ قُرْءَانًا عَرَبِيًّا وَصَرَّفْنَا فِيهِ مِنَ ٱلْوَعِيدِ لَعَلَّهُمْ يَتَّقُونَ أَوْ يُحْدِثُ لَهُمْ ذِكْرًا","translation":"Thus have We sent this down - an arabic Qur'an - and explained therein in detail some of the warnings, in order that they may fear Allah, or that it may cause their remembrance (of Him).","transliteration":"Wakathalika anzalnahu qur-ananAAarabiyyan wasarrafna feehi mina alwaAAeedilaAAallahum yattaqoona aw yuhdithu lahum thikra"},{"arabic":"فَتَعَـٰلَى ٱللَّهُ ٱلْمَلِكُ ٱلْحَقُّ ۗ وَلَا تَعْجَلْ بِٱلْقُرْءَانِ مِن قَبْلِ أَن يُقْضَىٰٓ إِلَيْكَ وَحْيُهُۥ ۖ وَقُل رَّبِّ زِدْنِى عِلْمًا","translation":"High above all is Allah, the King, the Truth! Be not in haste with the Qur'an before its revelation to thee is completed, but say, \"O my Lord! advance me in knowledge.\"","transliteration":"FataAAala Allahualmaliku alhaqqu wala taAAjal bilqur-animin qabli an yuqda ilayka wahyuhu waqul rabbizidnee AAilma"},{"arabic":"وَلَقَدْ عَهِدْنَآ إِلَىٰٓ ءَادَمَ مِن قَبْلُ فَنَسِىَ وَلَمْ نَجِدْ لَهُۥ عَزْمًا","translation":"We had already, beforehand, taken the covenant of Adam, but he forgot: and We found on his part no firm resolve.","transliteration":"Walaqad AAahidna ila adamamin qablu fanasiya walam najid lahu AAazma"},{"arabic":"وَإِذْ قُلْنَا لِلْمَلَـٰٓئِكَةِ ٱسْجُدُوا۟ لِـَٔادَمَ فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ أَبَىٰ","translation":"When We said to the angels, \"Prostrate yourselves to Adam\", they prostrated themselves, but not Iblis: he refused.","transliteration":"Wa-ith qulna lilmala-ikatiosjudoo li-adama fasajadoo illa ibleesa aba"},{"arabic":"فَقُلْنَا يَـٰٓـَٔادَمُ إِنَّ هَـٰذَا عَدُوٌّ لَّكَ وَلِزَوْجِكَ فَلَا يُخْرِجَنَّكُمَا مِنَ ٱلْجَنَّةِ فَتَشْقَىٰٓ","translation":"Then We said: \"O Adam! verily, this is an enemy to thee and thy wife: so let him not get you both out of the Garden, so that thou art landed in misery.","transliteration":"Faqulna ya adamu innahatha AAaduwwun laka walizawjika falayukhrijannakuma mina aljannati fatashqa"},{"arabic":"إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَىٰ","translation":"\"There is therein (enough provision) for thee not to go hungry nor to go naked,","transliteration":"Inna laka alla tajooAAa feehawala taAAra"},{"arabic":"وَأَنَّكَ لَا تَظْمَؤُا۟ فِيهَا وَلَا تَضْحَىٰ","translation":"\"Nor to suffer from thirst, nor from the sun's heat.\"","transliteration":"Waannaka la tathmaofeeha wala tadha"},{"arabic":"فَوَسْوَسَ إِلَيْهِ ٱلشَّيْطَـٰنُ قَالَ يَـٰٓـَٔادَمُ هَلْ أَدُلُّكَ عَلَىٰ شَجَرَةِ ٱلْخُلْدِ وَمُلْكٍ لَّا يَبْلَىٰ","translation":"But Satan whispered evil to him: he said, \"O Adam! shall I lead thee to the Tree of Eternity and to a kingdom that never decays?\"","transliteration":"Fawaswasa ilayhi ashshaytanuqala ya adamu hal adulluka AAalashajarati alkhuldi wamulkin la yabla"},{"arabic":"فَأَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْءَٰتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ ٱلْجَنَّةِ ۚ وَعَصَىٰٓ ءَادَمُ رَبَّهُۥ فَغَوَىٰ","translation":"In the result, they both ate of the tree, and so their nakedness appeared to them: they began to sew together, for their covering, leaves from the Garden: thus did Adam disobey his Lord, and allow himself to be seduced.","transliteration":"Faakala minha fabadat lahumasaw-atuhuma watafiqa yakhsifaniAAalayhima min waraqi aljannati waAAasa adamurabbahu faghawa"},{"arabic":"ثُمَّ ٱجْتَبَـٰهُ رَبُّهُۥ فَتَابَ عَلَيْهِ وَهَدَىٰ","translation":"But his Lord chose him (for His Grace): He turned to him, and gave him Guidance.","transliteration":"Thumma ijtabahu rabbuhu fatabaAAalayhi wahada"},{"arabic":"قَالَ ٱهْبِطَا مِنْهَا جَمِيعًۢا ۖ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى فَمَنِ ٱتَّبَعَ هُدَاىَ فَلَا يَضِلُّ وَلَا يَشْقَىٰ","translation":"He said: \"Get ye down, both of you,- all together, from the Garden, with enmity one to another: but if, as is sure, there comes to you Guidance from Me, whosoever follows My Guidance, will not lose his way, nor fall into misery.","transliteration":"Qala ihbita minhajameeAAan baAAdukum libaAAdin AAaduwwun fa-immaya/tiyannakum minnee hudan famani ittabaAAa hudaya falayadillu wala yashqa"},{"arabic":"وَمَنْ أَعْرَضَ عَن ذِكْرِى فَإِنَّ لَهُۥ مَعِيشَةً ضَنكًا وَنَحْشُرُهُۥ يَوْمَ ٱلْقِيَـٰمَةِ أَعْمَىٰ","translation":"\"But whosoever turns away from My Message, verily for him is a life narrowed down, and We shall raise him up blind on the Day of Judgment.\"","transliteration":"Waman aAArada AAan thikreefa-inna lahu maAAeeshatan danka wanahshuruhuyawma alqiyamati aAAma"},{"arabic":"قَالَ رَبِّ لِمَ حَشَرْتَنِىٓ أَعْمَىٰ وَقَدْ كُنتُ بَصِيرًا","translation":"He will say: \"O my Lord! why hast Thou raised me up blind, while I had sight (before)?\"","transliteration":"Qala rabbi lima hashartaneeaAAma waqad kuntu baseera"},{"arabic":"قَالَ كَذَٰلِكَ أَتَتْكَ ءَايَـٰتُنَا فَنَسِيتَهَا ۖ وَكَذَٰلِكَ ٱلْيَوْمَ تُنسَىٰ","translation":"(Allah) will say: \"Thus didst Thou, when Our Signs came unto thee, disregard them: so wilt thou, this day, be disregarded.\"","transliteration":"Qala kathalika atatka ayatunafanaseetaha wakathalika alyawma tunsa"},{"arabic":"وَكَذَٰلِكَ نَجْزِى مَنْ أَسْرَفَ وَلَمْ يُؤْمِنۢ بِـَٔايَـٰتِ رَبِّهِۦ ۚ وَلَعَذَابُ ٱلْـَٔاخِرَةِ أَشَدُّ وَأَبْقَىٰٓ","translation":"And thus do We recompense him who transgresses beyond bounds and believes not in the Signs of his Lord: and the Penalty of the Hereafter is far more grievous and more enduring.","transliteration":"Wakathalika najzee man asrafa walamyu/min bi-ayati rabbihi walaAAathabu al-akhiratiashaddu waabqa"},{"arabic":"أَفَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ ٱلْقُرُونِ يَمْشُونَ فِى مَسَـٰكِنِهِمْ ۗ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّأُو۟لِى ٱلنُّهَىٰ","translation":"Is it not a warning to such men (to call to mind) how many generations before them We destroyed, in whose haunts they (now) move? Verily, in this are Signs for men endued with understanding.","transliteration":"Afalam yahdi lahum kam ahlaknaqablahum mina alqurooni yamshoona fee masakinihim inna feethalika laayatin li-olee annuha"},{"arabic":"وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَكَانَ لِزَامًا وَأَجَلٌ مُّسَمًّى","translation":"Had it not been for a Word that went forth before from thy Lord, (their punishment) must necessarily have come; but there is a Term appointed (for respite).","transliteration":"Walawla kalimatun sabaqat minrabbika lakana lizaman waajalun musamma"},{"arabic":"فَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ غُرُوبِهَا ۖ وَمِنْ ءَانَآئِ ٱلَّيْلِ فَسَبِّحْ وَأَطْرَافَ ٱلنَّهَارِ لَعَلَّكَ تَرْضَىٰ","translation":"Therefore be patient with what they say, and celebrate (constantly) the praises of thy Lord, before the rising of the sun, and before its setting; yea, celebrate them for part of the hours of the night, and at the sides of the day: that thou mayest have (spiritual) joy.","transliteration":"Fasbir AAala mayaqooloona wasabbih bihamdi rabbika qabla tulooAAiashshamsi waqabla ghuroobiha wamin ana-iallayli fasabbih waatrafa annaharilaAAallaka tarda"},{"arabic":"وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوَٰجًا مِّنْهُمْ زَهْرَةَ ٱلْحَيَوٰةِ ٱلدُّنْيَا لِنَفْتِنَهُمْ فِيهِ ۚ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَىٰ","translation":"Nor strain thine eyes in longing for the things We have given for enjoyment to parties of them, the splendour of the life of this world, through which We test them: but the provision of thy Lord is better and more enduring.","transliteration":"Wala tamuddanna AAaynayka ilama mattaAAna bihi azwajan minhum zahrata alhayatiaddunya linaftinahum feehi warizqu rabbika khayrunwaabqa"},{"arabic":"وَأْمُرْ أَهْلَكَ بِٱلصَّلَوٰةِ وَٱصْطَبِرْ عَلَيْهَا ۖ لَا نَسْـَٔلُكَ رِزْقًا ۖ نَّحْنُ نَرْزُقُكَ ۗ وَٱلْعَـٰقِبَةُ لِلتَّقْوَىٰ","translation":"Enjoin prayer on thy people, and be constant therein. We ask thee not to provide sustenance: We provide it for thee. But the (fruit of) the Hereafter is for righteousness.","transliteration":"Wa/mur ahlaka bissalatiwastabir AAalayha la nas-alukarizqan nahnu narzuquka walAAaqibatu littaqwa"},{"arabic":"وَقَالُوا۟ لَوْلَا يَأْتِينَا بِـَٔايَةٍ مِّن رَّبِّهِۦٓ ۚ أَوَلَمْ تَأْتِهِم بَيِّنَةُ مَا فِى ٱلصُّحُفِ ٱلْأُولَىٰ","translation":"They say: \"Why does he not bring us a sign from his Lord?\" Has not a Clear Sign come to them of all that was in the former Books of revelation?","transliteration":"Waqaloo lawla ya/teenabi-ayatin min rabbihi awa lam ta/tihim bayyinatu mafee assuhufi al-oola"},{"arabic":"وَلَوْ أَنَّآ أَهْلَكْنَـٰهُم بِعَذَابٍ مِّن قَبْلِهِۦ لَقَالُوا۟ رَبَّنَا لَوْلَآ أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ ءَايَـٰتِكَ مِن قَبْلِ أَن نَّذِلَّ وَنَخْزَىٰ","translation":"And if We had inflicted on them a penalty before this, they would have said: \"Our Lord! If only Thou hadst sent us a messenger, we should certainly have followed Thy Signs before we were humbled and put to shame.\"","transliteration":"Walaw anna ahlaknahum biAAathabinmin qablihi laqaloo rabbana lawla arsaltailayna rasoolan fanattabiAAa ayatika minqabli an nathilla wanakhza"},{"arabic":"قُلْ كُلٌّ مُّتَرَبِّصٌ فَتَرَبَّصُوا۟ ۖ فَسَتَعْلَمُونَ مَنْ أَصْحَـٰبُ ٱلصِّرَٰطِ ٱلسَّوِىِّ وَمَنِ ٱهْتَدَىٰ","translation":"Say: \"Each one (of us) is waiting: wait ye, therefore, and soon shall ye know who it is that is on the straight and even way, and who it is that has received Guidance.\"","transliteration":"Qul kullun mutarabbisun fatarabbasoofasataAAlamoona man as-habu assiratiassawiyyi wamani ihtada"}]}