{"name":{"entry":64,"name":"At-Taghabun","meaning":"The Mutual Disillusion"},"verses":[{"arabic":" يُسَبِّحُ لِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۖ لَهُ ٱلْمُلْكُ وَلَهُ ٱلْحَمْدُ ۖ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ","translation":"Whatever is in the heavens and on earth, doth declare the Praises and Glory of Allah: to Him belongs dominion, and to Him belongs praise: and He has power over all things.","transliteration":"Yusabbihu lillahi ma feeassamawati wama fee al-ardilahu almulku walahu alhamdu wahuwa AAala kullishay-in qadeer"},{"arabic":"هُوَ ٱلَّذِى خَلَقَكُمْ فَمِنكُمْ كَافِرٌ وَمِنكُم مُّؤْمِنٌ ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","translation":"It is He Who has created you; and of you are some that are Unbelievers, and some that are Believers: and Allah sees well all that ye do.","transliteration":"Huwa allathee khalaqakum faminkum kafirunwaminkum mu/minun wallahu bima taAAmaloonabaseer"},{"arabic":"خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ بِٱلْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ۖ وَإِلَيْهِ ٱلْمَصِيرُ","translation":"He has created the heavens and the earth in just proportions, and has given you shape, and made your shapes beautiful: and to Him is the final Goal.","transliteration":"Khalaqa assamawati wal-ardabilhaqqi wasawwarakum faahsana suwarakumwa-ilayhi almaseer"},{"arabic":"يَعْلَمُ مَا فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ ۚ وَٱللَّهُ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ","translation":"He knows what is in the heavens and on earth; and He knows what ye conceal and what ye reveal: yea, Allah knows well the (secrets) of (all) hearts.","transliteration":"YaAAlamu ma fee assamawatiwal-ardi wayaAAlamu ma tusirroona wamatuAAlinoona wallahu AAaleemun bithati assudoor"},{"arabic":"أَلَمْ يَأْتِكُمْ نَبَؤُا۟ ٱلَّذِينَ كَفَرُوا۟ مِن قَبْلُ فَذَاقُوا۟ وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ","translation":"Has not the story reached you, of those who rejected Faith aforetime? So they tasted the evil result of their conduct; and they had a grievous Penalty.","transliteration":"Alam ya/tikum nabao allatheena kafaroomin qablu fathaqoo wabala amrihim walahum AAathabunaleem"},{"arabic":"ذَٰلِكَ بِأَنَّهُۥ كَانَت تَّأْتِيهِمْ رُسُلُهُم بِٱلْبَيِّنَـٰتِ فَقَالُوٓا۟ أَبَشَرٌ يَهْدُونَنَا فَكَفَرُوا۟ وَتَوَلَّوا۟ ۚ وَّٱسْتَغْنَى ٱللَّهُ ۚ وَٱللَّهُ غَنِىٌّ حَمِيدٌ","translation":"That was because there came to them messengers with Clear Signs, but they said: \"Shall (mere) human beings direct us?\" So they rejected (the Message) and turned away. But Allah can do without (them): and Allah is free of all needs, worthy of all praise.","transliteration":"Thalika bi-annahu kanatta/teehim rusuluhum bilbayyinati faqalooabasharun yahdoonana fakafaroo watawallaw wastaghnaAllahu wallahu ghaniyyun hameed"},{"arabic":"زَعَمَ ٱلَّذِينَ كَفَرُوٓا۟ أَن لَّن يُبْعَثُوا۟ ۚ قُلْ بَلَىٰ وَرَبِّى لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ ۚ وَذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٌ","translation":"The Unbelievers think that they will not be raised up (for Judgment). Say: \"Yea, By my Lord, Ye shall surely be raised up: then shall ye be told (the truth) of all that ye did. And that is easy for Allah.\"","transliteration":"ZaAAama allatheena kafaroo an lanyubAAathoo qul bala warabbee latubAAathunna thummalatunabbaonna bima AAamiltum wathalika AAalaAllahi yaseer"},{"arabic":"فَـَٔامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَٱلنُّورِ ٱلَّذِىٓ أَنزَلْنَا ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ","translation":"Believe, therefore, in Allah and His Messenger, and in the Light which we have sent down. And Allah is well acquainted with all that ye do.","transliteration":"Faaminoo billahiwarasoolihi wannoori allathee anzalna wallahubima taAAmaloona khabeer"},{"arabic":"يَوْمَ يَجْمَعُكُمْ لِيَوْمِ ٱلْجَمْعِ ۖ ذَٰلِكَ يَوْمُ ٱلتَّغَابُنِ ۗ وَمَن يُؤْمِنۢ بِٱللَّهِ وَيَعْمَلْ صَـٰلِحًا يُكَفِّرْ عَنْهُ سَيِّـَٔاتِهِۦ وَيُدْخِلْهُ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًا ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ","translation":"The Day that He assembles you (all) for a Day of Assembly,- that will be a Day of mutual loss and gain (among you), and those who believe in Allah and work righteousness,- He will remove from them their ills, and He will admit them to Gardens beneath which Rivers flow, to dwell therein for ever: that will be the Supreme Achievement.","transliteration":"Yawma yajmaAAukum liyawmi aljamAAi thalikayawmu attaghabuni waman yu/min billahiwayaAAmal salihan yukaffir AAanhu sayyi-atihiwayudkhilhu jannatin tajree min tahtihaal-anharu khalideena feeha abadan thalikaalfawzu alAAatheem"},{"arabic":"وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَـٰتِنَآ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ خَـٰلِدِينَ فِيهَا ۖ وَبِئْسَ ٱلْمَصِيرُ","translation":"But those who reject Faith and treat Our Signs as falsehoods, they will be Companions of the Fire, to dwell therein for aye: and evil is that Goal.","transliteration":"Wallatheena kafaroo wakaththaboobi-ayatina ola-ika as-habuannari khalideena feeha wabi/sa almaseer"},{"arabic":"مَآ أَصَابَ مِن مُّصِيبَةٍ إِلَّا بِإِذْنِ ٱللَّهِ ۗ وَمَن يُؤْمِنۢ بِٱللَّهِ يَهْدِ قَلْبَهُۥ ۚ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌ","translation":"No kind of calamity can occur, except by the leave of Allah: and if any one believes in Allah, (Allah) guides his heart (aright): for Allah knows all things.","transliteration":"Ma asaba min museebatinilla bi-ithni Allahi waman yu/min billahiyahdi qalbahu wallahu bikulli shay-in AAaleem"},{"arabic":"وَأَطِيعُوا۟ ٱللَّهَ وَأَطِيعُوا۟ ٱلرَّسُولَ ۚ فَإِن تَوَلَّيْتُمْ فَإِنَّمَا عَلَىٰ رَسُولِنَا ٱلْبَلَـٰغُ ٱلْمُبِينُ","translation":"So obey Allah, and obey His Messenger: but if ye turn back, the duty of Our Messenger is but to proclaim (the Message) clearly and openly.","transliteration":"WaateeAAoo Allaha waateeAAooarrasoola fa-in tawallaytum fa-innama AAalarasoolina albalaghu almubeen"},{"arabic":"ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ","translation":"Allah! There is no god but He: and on Allah, therefore, let the Believers put their trust.","transliteration":"Allahu la ilaha illahuwa waAAala Allahi falyatawakkali almu/minoon"},{"arabic":"يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِنَّ مِنْ أَزْوَٰجِكُمْ وَأَوْلَـٰدِكُمْ عَدُوًّا لَّكُمْ فَٱحْذَرُوهُمْ ۚ وَإِن تَعْفُوا۟ وَتَصْفَحُوا۟ وَتَغْفِرُوا۟ فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ","translation":"O ye who believe! Truly, among your wives and your children are (some that are) enemies to yourselves: so beware of them! But if ye forgive and overlook, and cover up (their faults), verily Allah is Oft-Forgiving, Most Merciful.","transliteration":"Ya ayyuha allatheena amanooinna min azwajikum waawladikum AAaduwwan lakum fahtharoohumwa-in taAAfoo watasfahoo wataghfiroo fa-inna Allahaghafoorun raheem"},{"arabic":"إِنَّمَآ أَمْوَٰلُكُمْ وَأَوْلَـٰدُكُمْ فِتْنَةٌ ۚ وَٱللَّهُ عِندَهُۥٓ أَجْرٌ عَظِيمٌ","translation":"Your riches and your children may be but a trial: but in the Presence of Allah, is the highest, Reward.","transliteration":"Innama amwalukum waawladukumfitnatun wallahu AAindahu ajrun AAatheem"},{"arabic":"فَٱتَّقُوا۟ ٱللَّهَ مَا ٱسْتَطَعْتُمْ وَٱسْمَعُوا۟ وَأَطِيعُوا۟ وَأَنفِقُوا۟ خَيْرًا لِّأَنفُسِكُمْ ۗ وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ","translation":"So fear Allah as much as ye can; listen and obey and spend in charity for the benefit of your own soul and those saved from the covetousness of their own souls,- they are the ones that achieve prosperity.","transliteration":"Fattaqoo Allaha maistataAAtum wasmaAAoo waateeAAoo waanfiqookhayran li-anfusikum waman yooqa shuhha nafsihi faola-ikahumu almuflihoon"},{"arabic":"إِن تُقْرِضُوا۟ ٱللَّهَ قَرْضًا حَسَنًا يُضَـٰعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ ۚ وَٱللَّهُ شَكُورٌ حَلِيمٌ","translation":"If ye loan to Allah, a beautiful loan, He will double it to your (credit), and He will grant you Forgiveness: for Allah is most Ready to appreciate (service), Most Forbearing,-","transliteration":"In tuqridoo Allaha qardanhasanan yudaAAifhu lakum wayaghfir lakum wallahushakoorun haleem"},{"arabic":"عَـٰلِمُ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ ٱلْعَزِيزُ ٱلْحَكِيمُ","translation":"Knower of what is hidden and what is open, Exalted in Might, Full of Wisdom.","transliteration":"AAalimu alghaybi washshahadatialAAazeezu alhakeem"}]}